In [61]:
import pandas as pd
import numpy as np

In [62]:
marks=pd.Series([30,35,40],index=["python","DBMS","DSA"])

In [63]:
marks

python    30
DBMS      35
DSA       40
dtype: int64

In [64]:
marks=pd.Series(["harshit","harshit@gmail.com","paris"],index=["name","gmail","addres"])

In [65]:
marks

name                harshit
gmail     harshit@gmail.com
addres                paris
dtype: object

In [66]:
d={"name":'harshit',"gmail":'harshit767@gamil.com',"address":'vadodara'}

In [67]:
student=pd.Series(d)

In [68]:
student

name                    harshit
gmail      harshit767@gamil.com
address                vadodara
dtype: object

In [69]:
student.keys()

Index(['name', 'gmail', 'address'], dtype='object')

In [70]:
student.values

array(['harshit', 'harshit767@gamil.com', 'vadodara'], dtype=object)

In [71]:
marks=np.random.randint(0,100,(3,3))

In [72]:
marks

array([[46, 94, 95],
       [75, 96, 95],
       [65, 91,  8]])

In [73]:
Result=pd.DataFrame(marks,index=['harshit','vrund','smit'],columns=["python","DSA","DBMS"])
Result

         python  DSA  DBMS
harshit      46   94    95
vrund        75   96    95
smit         65   91     8

In [74]:
Result['python']

harshit    46
vrund      75
smit       65
Name: python, dtype: int32

In [75]:
Result[['python','DBMS']]

         python  DBMS
harshit      46    95
vrund        75    95
smit         65     8

In [76]:
Result.loc['harshit']

python    46
DSA       94
DBMS      95
Name: harshit, dtype: int32

In [77]:
Result.loc[['harshit','vrund']]

         python  DSA  DBMS
harshit      46   94    95
vrund        75   96    95

Result

In [78]:
Result['total']=Result['python']+Result['DSA']+Result['DBMS']

In [79]:
Result

         python  DSA  DBMS  total
harshit      46   94    95    235
vrund        75   96    95    266
smit         65   91     8    164

In [80]:
Result['percentage']=Result['total']/3
Result

         python  DSA  DBMS  total  percentage
harshit      46   94    95    235   78.333333
vrund        75   96    95    266   88.666667
smit         65   91     8    164   54.666667

In [81]:
Result.drop('total',axis=1)

         python  DSA  DBMS  percentage
harshit      46   94    95   78.333333
vrund        75   96    95   88.666667
smit         65   91     8   54.666667

In [82]:
Result.drop('DSA',axis=1,inplace=True)
Result

         python  DBMS  total  percentage
harshit      46    95    235   78.333333
vrund        75    95    266   88.666667
smit         65     8    164   54.666667

In [83]:
Result.loc['harshit']

python         46.000000
DBMS           95.000000
total         235.000000
percentage     78.333333
Name: harshit, dtype: float64

In [84]:
Result.drop('harshit',axis=0)

       python  DBMS  total  percentage
vrund      75    95    266   88.666667
smit       65     8    164   54.666667

In [85]:
Result.describe()

         python       DBMS       total  percentage
count   3.00000   3.000000    3.000000    3.000000
mean   62.00000  66.000000  221.666667   73.888889
std    14.73092  50.229473   52.290853   17.430284
min    46.00000   8.000000  164.000000   54.666667
25%    55.50000  51.500000  199.500000   66.500000
50%    65.00000  95.000000  235.000000   78.333333
75%    70.00000  95.000000  250.500000   83.500000
max    75.00000  95.000000  266.000000   88.666667

In [86]:
Result.head()

         python  DBMS  total  percentage
harshit      46    95    235   78.333333
vrund        75    95    266   88.666667
smit         65     8    164   54.666667

In [87]:
Result.head(2)

         python  DBMS  total  percentage
harshit      46    95    235   78.333333
vrund        75    95    266   88.666667

In [88]:
Result.tail()

         python  DBMS  total  percentage
harshit      46    95    235   78.333333
vrund        75    95    266   88.666667
smit         65     8    164   54.666667

In [89]:
Result.loc[['harshit','vrund'],['percentage','DBMS']]

         percentage  DBMS
harshit   78.333333    95
vrund     88.666667    95

In [90]:
Result.loc['HET']=[45,92.0]
Result

ValueError: cannot set a row with mismatched columns

In [ ]:
import pandas as pd
import numpy as np

In [91]:
li=pd.Series([30,627,40],index=["productid","product name","product price"])

In [92]:
li

productid         30
product name     627
product price     40
dtype: int64

In [93]:
dict={'product id':[100,102,103,104,105],'product name':['pen','lens','tube','pen','glass'],'product price':[30,52,73,74,85]}
df=pd.DataFrame(dict)
df

   product id product name  product price
0         100          pen             30
1         102         lens             52
2         103         tube             73
3         104          pen             74
4         105        glass             85

In [94]:
df['product id']

0    100
1    102
2    103
3    104
4    105
Name: product id, dtype: int64

In [95]:
df['product name']

0      pen
1     lens
2     tube
3      pen
4    glass
Name: product name, dtype: object

In [96]:
df['product price']

0    30
1    52
2    73
3    74
4    85
Name: product price, dtype: int64

In [97]:
import pandas as pd
import numpy as np

In [98]:
Result[Result['python']<40]

Empty DataFrame
Columns: [python, DBMS, total, percentage]
Index: []

In [99]:
Result['python']<40

harshit    False
vrund      False
smit       False
Name: python, dtype: bool

In [100]:
Result.loc[Result['python']<40,'python']=41
Result

         python  DBMS  total  percentage
harshit      46    95    235   78.333333
vrund        75    95    266   88.666667
smit         65     8    164   54.666667

In [101]:
Result.add(20)

         python  DBMS  total  percentage
harshit      66   115    255   98.333333
vrund        95   115    286  108.666667
smit         85    28    184   74.666667

In [102]:
Result>100

         python   DBMS  total  percentage
harshit   False  False   True       False
vrund     False  False   True       False
smit      False  False   True       False

In [103]:
Result[(Result['python']>25) & (Result['DBMS']>25)]

         python  DBMS  total  percentage
harshit      46    95    235   78.333333
vrund        75    95    266   88.666667

In [104]:
Result[Result.index.str.endswith('t')]

         python  DBMS  total  percentage
harshit      46    95    235   78.333333
smit         65     8    164   54.666667

In [105]:
Result

         python  DBMS  total  percentage
harshit      46    95    235   78.333333
vrund        75    95    266   88.666667
smit         65     8    164   54.666667

In [106]:
Result[Result.index.str.startswith('h')]

         python  DBMS  total  percentage
harshit      46    95    235   78.333333

In [107]:
Result['Result']=np.where(Result['percentage']<40,"Fail","Pass")
Result

         python  DBMS  total  percentage Result
harshit      46    95    235   78.333333   Pass
vrund        75    95    266   88.666667   Pass
smit         65     8    164   54.666667   Pass

In [108]:
Result['Result']=np.where(Result['percentage']<75,"C")
['Result']=np.where(Result['percentage']<95,"A")
['Result']=np.where(Result['percentage']<85,"B")

SyntaxError: cannot assign to literal (1726551767.py, line 2)

In [109]:
Result.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, harshit to smit
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   python      3 non-null      int32
 1   DBMS        3 non-null      int32
 2   total       3 non-null      int32
 3   percentage  3 non-null      float64
 4   Result      3 non-null      object
dtypes: float64(1), int32(3), object(1)
memory usage: 216.0+ bytes

In [110]:
Result['DBMS']

harshit    95
vrund      95
smit        8
Name: DBMS, dtype: int32

In [111]:
Result.describe()

         python       DBMS       total  percentage
count   3.00000   3.000000    3.000000    3.000000
mean   62.00000  66.000000  221.666667   73.888889
std    14.73092  50.229473   52.290853   17.430284
min    46.00000   8.000000  164.000000   54.666667
25%    55.50000  51.500000  199.500000   66.500000
50%    65.00000  95.000000  235.000000   78.333333
75%    70.00000  95.000000  250.500000   83.500000
max    75.00000  95.000000  266.000000   88.666667

In [112]:
Result.to_excel('Result1.xlsx')

In [113]:
Result=pd.read_csv("C:/Users/Admin/Downloads/datasets/Salaries.csv")

C:\Users\Admin\AppData\Local\Temp\ipykernel_6740\4246717905.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  Result=pd.read_csv("C:/Users/Admin/Downloads/datasets/Salaries.csv")

In [114]:
Result.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [115]:
Result=Result.relpace('Not provided',np.nan)

AttributeError: 'DataFrame' object has no attribute 'relpace'

In [116]:
Result["BasePay"].mean()

TypeError: unsupported operand type(s) for +: 'float' and 'str'